<!-- tfplan-comment -->
## Terraform plan (Cloudflare DNS)

Commit: 1293db87376766169dd5bbea5d1515af722bc581

<details><summary>Show plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_dns_record.altilium_app_dkim_fm1 will be created
  + resource "cloudflare_dns_record" "altilium_app_dkim_fm1" {
      + content          = "fm1.altilium.app.dkim.fmhosted.com"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "fm1._domainkey"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "141d321f65157c63db2f0b263a68feed"
    }

  # cloudflare_dns_record.altilium_app_dkim_fm2 will be created
  + resource "cloudflare_dns_record" "altilium_app_dkim_fm2" {
      + content          = "fm2.altilium.app.dkim.fmhosted.com"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "fm2._domainkey"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "141d321f65157c63db2f0b263a68feed"
    }

  # cloudflare_dns_record.altilium_app_dkim_fm3 will be created
  + resource "cloudflare_dns_record" "altilium_app_dkim_fm3" {
      + content          = "fm3.altilium.app.dkim.fmhosted.com"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "fm3._domainkey"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "141d321f65157c63db2f0b263a68feed"
    }

  # cloudflare_dns_record.altilium_app_mx_1 will be created
  + resource "cloudflare_dns_record" "altilium_app_mx_1" {
      + content          = "in1-smtp.messagingengine.com"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "@"
      + priority         = 10
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "MX"
      + zone_id          = "141d321f65157c63db2f0b263a68feed"
    }

  # cloudflare_dns_record.altilium_app_mx_2 will be created
  + resource "cloudflare_dns_record" "altilium_app_mx_2" {
      + content          = "in2-smtp.messagingengine.com"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "@"
      + priority         = 20
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "MX"
      + zone_id          = "141d321f65157c63db2f0b263a68feed"
    }

  # cloudflare_dns_record.altilium_app_spf will be created
  + resource "cloudflare_dns_record" "altilium_app_spf" {
      + content          = "v=spf1 include:spf.messagingengine.com ?all"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "@"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "141d321f65157c63db2f0b263a68feed"
    }

Plan: 6 to add, 0 to change, 0 to destroy.


```
</details>